function firstChar() {
  let firstCharLet = (document.getElementById("firstChar").value = `
  <h2>Викториано Уэрта</h2>
  <h3>Рождение и ранние годы Викториано Уэрты</h3>
  <p>Викториано Уэрта родилась в муниципалитете Колотлан, штат Халиско, 23 марта 1845 года. Ее семья имела коренные корни, которые в то время были препятствием для достижения великих целей или даже для обучения.</p>
  <p>В любом случае, удача была во многом связана с его первыми шагами в армии. Согласно сообщению, во время визита к нему по месту жительства генерала Донато Герры он был заинтересован в найме личного секретаря. Уэрта, который посещал муниципальную школу, вызвался добровольцем и получил работу.</p>
  <p>Его работа, должно быть, была очень хорошей, так как в качестве награды ему предложили стипендию, чтобы поступить в Военный колледж. Его квалификация была превосходной, он закончил учебу в звании лейтенанта в 1876 году.</p>
  <p>Его первые работы были в Инженерном корпусе. Там он разработал топографические карты в нескольких районах страны. Хотя он продолжал подниматься по военной лестнице, а когда он прибыл в 1890 году, он достиг степени полковника.</p>
  <h3>Военная карьера</h3>
  <p>После 8 лет, проведенных в Инженерном корпусе, Уэрта вошел в состав правительственного аппарата, который возглавлял Порфирио Диас. Во время многочисленных вооруженных восстаний коренных народов Уэрта приобрела репутацию жестокости и даже жестокости в попытке положить конец этим восстаниям.</p>
  <p>Таким образом, с 1900 года он участвовал в борьбе против «яков» в Соноре и вскоре после этого против майя в Юкатане и Кинтана-Роо. В качестве награды за репрессии против майя он был награжден воинской медалью за заслуги и назван генералом бригадным.</p>
  <p>Кроме того, он получил должность в Верховном военном суде нации. Этому способствовала его дружба с военным и военно-морским министром генералом Бернардо Рейесом.</p>
  <h3>Краткий выход на пенсию</h3>
  <p>На те даты у Уэрты уже были определенные проблемы со здоровьем. К его доказанной любви к алкоголю он присоединился к визуальному состоянию (катаракте), которое появилось во время его походов на Юкатан. Для этого в 1907 году он запросил разрешение и оставил армию на несколько лет.</p>
  <p>Он переехал в Монтеррей, где жил его друг Рейес. Там он работал начальником общественных работ. В 1909 году он вернулся в Мехико, чтобы преподавать математику.</p>
  <p>Тем не менее, политическая ситуация в настоящий момент заставляет его просить о его повторном вступлении в армию.</p>
  <h3>Революция Франциско И. Мадеро</h3>
  <p>Это вспышка мексиканской революции во главе с Франциско И. Мадеро, которая заставляет Уэрту вернуться в армию. Во-первых, он отвечает за подавление попыток мятежников, совершенных Сапатой. Точно так же он подавлял другие аграрные движения, которые боролись за возвращение земель, экспроприированных Порфирио Диасом.</p>
  <p>Несмотря на эту репрессивную работу, Уэрте удается пережить триумф Мадеро, разработав целый ряд уловок и политических предательств для достижения своих целей.</p>
  <p>Когда Порфириато пал, Уэрта остался верен новому правительству, хотя его обвинили в организации некоторых провокационных действий против армии Эмилиано Сапаты. Это заставляет Мадеро попытаться избавиться от него. Однако после нового военного восстания президент отозвал его в ряды, пытаясь воспользоваться его опытом.</p>
  <p>Настолько хороша была его работа по подавлению этой попытки восстания во главе с Паскуалем Орозко, который становится национальным героем. Несмотря на это, он поддерживал определенные столкновения с другими революционными лидерами, такими как Панчо Вилья, которого он даже приказал расстрелять.</p>
  <p>Вилла была спасена благодаря вмешательству братьев Мадеро и президенту приказал Уэрте подать в отставку с поста.</p>
  <h3>Десять трагических и президентских</h3>
  <p>В этой конвульсивной среде Уэрта разрабатывает свой план достижения власти. С помощью различных маневров и предательств ему удается позиционировать себя в оптимальном положении, чтобы достичь президентства страны.</p>
  <p>Начало этого процесса - 9 февраля 1913 года. Именно тогда начинается так называемая Десять Трагических, десять дней, которые изменили ситуацию в Мексике. В тот день старый друг Уэрты, генерал Рейес, а также генерал Феликс Диас (племянник Порфирио) восстали против конституционного правительства Мадеро.</p>
  <p>Уэрта, который вернулся в армию и заявил о лояльности правительству, встречается с повстанцами, чтобы присоединиться к его делу. Он также подписывает договор с послом США Генри Уилсоном, яростно противоречащим Мадеро.</p>
  <p>Будучи военным начальником, он сумел предотвратить попадание подкреплений правительства в столицу, которая осталась без защиты благодаря успехам лидеров переворота. Уэрта убеждает Мадеро и его вице-президентов, что единственное, что могло бы спасти их жизнь, это уйти в отставку.</p>
  <h3>Уэрта, президент</h3>
  <p>С политическим планом в миллиметре, когда президент подал в отставку, этот пост автоматически перешел к Педро Ласкурану Паредесу, который способствовал устремлениям Уэрты. Lascuráin отвечает только за 45 минут. Достаточно назначить преемника Уэрты и уйти в отставку.</p>
  <p>После этого Мадеро убивают мужчины нового президента, несмотря на обещание пощадить их.</p>
  <h3>Президентское управление</h3>
  <p>Президентский срок Уэрты был довольно коротким, чуть более года. С самого начала он характеризовался своим авторитаризмом, избавлением от конкурентов и установлением военного режима без эффективной палаты депутатов.</p>
  <p>Кроме того, он потерял несколько опор, которые у него были в начале. Даже его американские союзники выступают против него, когда он выбирает британские компании для управления нефтяными скважинами.</p>
  <p>Во внутренних делах его правительство не было признано многими. Venustiano Carranza, лидер конституционализма, начал военную кампанию с первого дня правления Уэрты. Такие аграристы, как Сапата и Вилья, присоединились к Каррансе.</p>
  <p>Таким образом, 13 августа 1914 года Уэрта свергнут и должен уйти в изгнание.</p>
  <h3>Смерть</h3>
  <p>В своем изгнании Уэрта проходит через Ямайку, Великобританию, Испанию и, наконец, Соединенные Штаты. Он поддерживал контакты с членами правительства Германии, затем погрузился в Первую мировую войну. Его целью было заручиться его поддержкой, чтобы вернуться в Мексику и вернуть себе власть.</p>
  <p>Также попробуйте набрать своего бывшего соперника Паскуаля Орозко. Оба даже прибывают в Эль-Пасо с намерением въехать в Мексику. Там их останавливают американские власти, мало заинтересованных в покушении.</p>
  <p>Хотя первоначально он был приговорен к домашнему аресту из-за слабого здоровья. Уэрта снова пытается въехать в Мексику и снова арестован. На этот раз, если вы попадете в тюрьму. Там, в тюрьме Эль-Пасо, он умер 13 января 1916 года.</p>
  `);
  document.getElementById("firstChar").innerHTML = firstCharLet;
}

function secondChar() {
  let firstCharLet = (document.getElementById("firstChar").value = `
  <h2>Альваро Обрегон Салидо</h2>
  <p>Альваро Обрегон Салидо родился в Сикисиве, штат Сонора, 19 февраля 1880 года. Его раннее детство и юность не предвещали большой военной и политической карьеры, которую он собирался развивать.</p>
  <p>Его отец был фермером и умер в том же году, в котором родился будущий президент. Во время его начальных исследований он провел часть своего времени, работая в области.</p>
  <p>После окончания школы он продолжал работать в том же секторе, на этот раз в гасиенде в Уатабампо, пока ему не исполнилось 18 лет. Именно тогда он меняет профессию, хотя и на короткое время, так как вскоре вернулся к работе в поле.</p>
  <p>Будучи очень молодым, в 23 года он женился и купил ранчо, чтобы жить со своей семьей. Тем не менее, его жена умерла очень скоро, в 1907 году, и выйдет замуж спустя годы, когда он уже был вовлечен в политическую жизнь страны.</p>
  <p>Возможно, из-за его скромного происхождения и связанного с сельскохозяйственными работами Обрегон проявил симпатию к революционному движению, инициированному Франциско И. Мадеро.</p>
  <p>Хотя поначалу он не участвовал в событиях, которые привели к падению Порфирио Диаса и приходу к власти Мадеро, он вскоре стал вовлеченным в новый этап развития страны.</p>
  <p>Как только была провозглашена новая конституция и назначены муниципальные выборы, Обрегон представился и стал мэром Уатабампо в 1911 году.</p>
  <p>Поддержка коренной общины «яки» имела основополагающее значение в его победе, а также стала бы первым шагом к национальной политике.</p>
  <h3>Кампания против Орозко</h3>
  <p>Не все в стране приняли президентство Мадеро. Одним из тех, кто поднял оружие против его правительства, был Паскуаль Орозко, который ранее поддерживал его.</p>
  <p>По этому случаю Обрегон решает сделать шаг вперед и набирает большое количество мужчин, многие из которых яки, для защиты конституционного правительства.</p>
  <p>Примечательно, что именно он был ответственным за оплату людей под его командованием, хотя это правда, что ему позже возместили. Таким образом, уже в 1912 году хорошие результаты в военной области, которые он продемонстрировал, сделали его более известным на национальной сцене.</p>
  <p>Во время этой кампании он встретил того, кто станет одним из его более поздних соратников, Плутарко Элиаса Каллеса. Войска, верные Мадеро, в том числе во главе с Обрегоном, сумели победить Орозко. Обрегон возвращается на свою ферму, чтобы продолжить свою сельскохозяйственную работу, не желая принимать какую-либо должность в исполнительной власти.</p>
  <p>Немного покоя для Обрегона. В 1913 году состоялся государственный переворот во главе с Викториано Уэртой. После так называемой Десять Трагических и предательства и убийства Мадеро этому военному удается захватить власть и установить диктаторский режим в стране.</p>
  <p>С самого начала сторонники законного правительства готовятся к борьбе. Первым, кто не признал президентство Уэрты, является Венустиано Карранса, который призывает своих сторонников к оружию. Обрегон принимает партию немедленно и назначен военным начальником Эрмосильо.</p>
  <p>Эффективность его команды была огромна. Всего за несколько месяцев, в конце 1913 года, ему удалось занять весь Синалоа и Кулиакан. Позже он уходит на юг, неумолимо продвигаясь к Халиско. Там после некоторых важных сражений ему удается взять под контроль Гвадалахару.</p>
  <h3>Прибытие в Мехико</h3>
  <p>После этих побед осталось только войти в столицу. Уэрта уже признал свое поражение, спасаясь бегством от страны. Его люди пытались достичь соглашения с Обрегоном, но это началось с его армии и вошло в Мехико 14 августа 1914 года. Через несколько дней прибыл Карранса, который украсил Обрегон и инициировал смену режима.</p>
  <p>Создание нового правительства было нелегким делом. Вилья и Сапата не приняли Каррансу на пост президента и держали против него ополчение. Альваро Обрегон пытался разрешить эти разногласия, но тщетно.</p>
  <p>Назначенный главой армии, его задача состояла именно в том, чтобы покончить с его бывшими революционными союзниками. В 1915 году ему удалось победить Виллу, хотя он потерял руку в усилиях.</p>
  <p>Помимо этих военных побед, он стал очень популярным, например, для принятия закона о минимальной заработной плате в некоторых северных штатах. Карранса назначил его министром обороны и войны, но в 1917 году он подал в отставку и вновь занял свои земли.</p>
  <p>Однако политическая карьера Обрегона на этом не закончилась. Даже на расстоянии он заметил, что движения Каррансы могут подорвать революционные принципы, которые он поддерживал.</p>
  <p>Некоторые историки отмечают, что президент только пытался объединить разделенную нацию, но Обрегон и другие бывшие бойцы не были убеждены некоторыми уступками наиболее консервативным секторам.</p>
  <p>Вот почему он участвует в так называемом Плане Агуа Приета, целью которого было прекращение правительства Каррансиста. Восстание, последовавшее за этим планом, по которому некоторые губернаторы приняли решение не признавать власть правительства, закончилось убийством Каррансы и призывом к выборам.</p>
  <p>В них, несмотря на предыдущие шаги, которые пытались подорвать популярность Обрегона, ему удалось победить и занять позицию.</p>
  <h3>Президентство (1920 - 1924)</h3>
  <p>Альваро Обрегон присягнул на пост президента в ноябре 1920 года. Верный своей программе, он провел важную аграрную реформу, а также другую трудовую реформу. Кроме того, он предпринял глубокие изменения в образовательной политике.</p>
  <p>Первоначально он нашел многочисленные поддержки среди крестьян, рабочих и интеллигенции. В международной политике он возобновил отношения с США и изменил образ действий дипломатов и консулов.</p>
  <p>Среди своих противников он выделил католическую церковь. Как аграрная, так и образовательная реформы подорвали традиционное влияние церкви в мексиканской политике.</p>
  <p>Особенно яростной была его реакция на Плутарко Элиаса Каллеса, сначала министра образования, а затем преемника Обрегона на посту президента. На самом деле, Элиас Кальес перенес так называемую войну Кристеро, которую вели католические верующие, и оставил много мертвых на улицах.</p>
  <p>В 1924 году, после завершения работы законодательного органа, Обрегон вернулся к своим сельскохозяйственным работам, хотя продолжал следить за политической ситуацией.</p>
  <p>Чтобы Обрегон появился вновь, необходимо было реформировать мексиканскую конституцию, поскольку переизбрание было запрещено. Тем не менее, Элиас Кальес и другие сторонники убедили Обрегона принять.</p>
  <p>На этот раз, однако, было много оппозиции. И его бывшие союзники по Яки, и старые революционеры пытались восстать против него, но безуспешно.</p>
  <p>После проведения выборов Обрегон снова одержал победу. Однако у него не будет возможности вернуть себе власть. Кристеро, который был против политики, которая ослабила Церковь, убил его 17 июля 1928 года.</p>
  `);
  document.getElementById("firstChar").innerHTML = firstCharLet;
}

function thirdChar() {
  let firstCharLet = (document.getElementById("firstChar").value = `
  <h2>Панчо Вилья</h2>
  <p>Панчо Вилья — любимый герой Мексиканской революции 1910-1917 годов. Он был простым батраком, грабителем помещичьих усадьб, прославленным полководцем, эгоманьяком и низвергателем узурпаторов. А еще он устраивал набеги на американские города на «Харли-Дэвидсонах» и пережил столько предательств, что хватило бы на целый сериал. Правда, в итоге он потерял голову, буквально. Тело великого мятежника покоится в могиле без головы — ее кто-то украл.</p>
  <p>Его настоящее имя — Хосе Доротео Аранго Арамбула. Он родился в 1878 в семье простого пеона, то есть батрака, в мексиканском штате Дуранго. Отец будущего бунтовщика рано умер, и Хосе пришлось много и усердно работать. Его хозяева были редкостными ублюдками: он несколько раз пытался сбежать с фермы, но его ловили и жестоко избивали. Однажды сын помещика, Агустин Лопес Негрете, изнасиловал сестру Хосе. Это было последней каплей: он потратил последние деньги на револьвер и пристрелил хозяина. Позже он расквитается и с самим насильником. Но сначала ему пришлось скрываться. </p>
  <p>Он бродил по горам и пампасам, почти ничего не зная о выживании в этих землях. Когда Панчо уже был при смерти, его спас отряд бунтовщиков, грабивший города и асиенды под руководством лихого Франсиско Вильи. Хосе взяли в отряд, и тут его широкая натура развернулась. Оказалось, что он — прирожденный смутьян, пылкий оратор и восхитительно ловкий грабитель. Никто во всем Дуранго не мог увести стадо богатого землевладельца так, как он. А это — уже задел на великого человека. По крайней мере, в Мексике тех лет. </p>
  <p>Однажды федералы все-таки подстрелили Франсиско Вилью и, умирая, он составил отряд на подающего надежды Хосе. Его соратники для простоты начали называть нового командира просто — Франсиско Вилья II. Эдакая бандитская монархия. Вскоре после этого в матушке-Мексике началась революция, и Панчо Вилья с его задатками расцвел по-настоящему. Первым же делом он совершил налет на асиенду, где горбатился в юности, и убил обидчика своей сестры. Сладкая месть!</p>
  <h3>Жизнь Панчо Вильи — это политическая «Санта-Барбара»</h3>
  <p>О жизни Панчо Вильи сняли множество фильмов. Но лучше всего из его биографии было бы сделать мексиканскую мыльную оперу, только не с любовным, а политическим уклоном. В грянувшей революции началась чертова неразбериха, все предавали всех, вчерашние революционеры становились узурпаторами, их свергали другие революционеры, которые сами становились узурпаторами и так далее. Латиноамериканская политика! Но Панчо Вилья в этом густом гуляше из крови и предательств чувствовал себя как в своей тарелке. И даже почти пережил всю эту суматоху. Почти.</p>
  <p>Предлагаю для развлечения подсчитывать предательства в этой истории. Загибайте пальцы. Едва поднявшись от конокрада до революционера, Панчо Вилья примкнул к сторонникам кандидата в президенты по имени Франсисико Мадеро. Тот обещал реформы и казался простым работягам славным парнем. Когда в 1910 Мадеро поднял восстание против президента Порфирио Диаса, народ откликнулся. Панчо здорово показал себя как партизанский командир, даже захватил ключевой город Сьюдад-Хуарес, через который повстанцы снабжались оружием. Близилась победа. Но один из соратников Панчо Вильи, генерал Викториано Уэрта, оказался лживой змеей (предательство номер один!). Он объявил Вилью изменником, который решил убить их горячо любимого лидера Мадеро. Нашему бунтовщику пришлось бежать в США. Затем сам Уэрта устроил переворот и занял место Мадеро (предательство номер два!).</p>
  `);
  document.getElementById("firstChar").innerHTML = firstCharLet;
}

function fourthChar() {
  let firstCharLet = (document.getElementById("firstChar").value = `
  <h2>Венустиано Каррансо</h2>
  <p>Венустиано Карранса Гарза родился в Куатро-Сьенегас (Коауила) 29 декабря 1859 года. В то время это был очень маленький город с населением всего две тысячи человек.</p>
  <p>Семья Карранса была одной из самых важных в регионе. Отец Венестиано, полковник Хесус Карранса, выделялся в деле республиканцев. Биографы утверждают, что он был объявленным поклонником Бенито Хуареса и что он воспитал своего сына, подставив его в качестве примера поведения.</p>
  <p>Кроме того, Хесус Карранса был погружен в политическую жизнь района и несколько раз занимал пост президента муниципалитета Куатро Сьенегас.</p>
  <p>Венустиано провел часть своего детства в своем родном муниципалитете. Его исследования проводились сначала в Сальтильо, а затем в Мехико. В столице, когда ему было 15 лет, он поступил в Национальную подготовительную школу.</p>
  <h3>Вступление в политику</h3>
  <p>Венустиано Карранса женился на Вирджинии Салинас в 1887 году. В том же году он также начал идти по стопам своего отца в местной политике. В то же время, перед смертью своего отца, он взял бразды правления асьенда, принадлежавшего семье.</p>
  <p>Его политическая карьера началась, когда он был избран президентом муниципалитета. С этой должности он поддерживал серьезные столкновения с губернатором штата Хосе Мария Гарса Галан. На самом деле, плохие отношения заставили Каррансу покинуть свой пост.</p>
  <p>Когда Гарза попытался баллотироваться на переизбрание, Карранса явно позиционировал себя против него. Да, он убедил Порфирио Диаса, что его позиция не против центрального правительства.</p>
  <p>Бернардо Рейес выступил посредником в этом вопросе и убедил Каррансу вернуться в политику. Таким образом, он вернулся в муниципальное президентство, которое поддерживалось между 1894 и 1898 годами. Помимо этой должности, он был депутатом в государственном конгрессе и сенатором в Конгрессе Союза.</p>
  <p>Уже в 1908 году Карранса был временно назначен губернатором Коауилы, и все ожидали, что этот пост будет окончательно подтвержден. Однако его отношения с Рейесом заставили Порфирио избегать его.</p>
  <h3>Начало революции</h3>
  <p>После десятилетий Порфириато многие слои мексиканского общества ожидали перемен на выборах 1910 года. Лидером оппозиции против Диаса был Франциско И. Мадеро, который основал движение с большим потенциалом для победы в голосовании.</p>
  <p>Тем не менее, во время избирательной кампании Мадеро был арестован правительственными силами и в конечном итоге сослан в Соединенные Штаты. Оттуда он запустил план Сан-Луиса, который предусматривал увольнение диктатора.</p>
  <p>Карранса, столкнувшись с этим, поначалу избегал компромиссов с движением Мадериста. По словам биографов, он ожидал, что Бернардо Рейес станет преемником Диаса и возьмет его с собой в правительство. Понимая, что этого не произойдет, он поддержал Мадеро и даже сопровождал его в изгнании в Сан-Антонио, штат Техас, и поддержал План-де-Сан-Луис.</p>
  <p>Триумф восстания против Диаса привел Мадеро к президентству. Карранса был назначен. Во-первых. Губернатор Коауилы, а затем министр обороны и флота.</p>
  <p>Будучи избранным губернатором своего штата, Карранса выделялся тем, что остановил восстание сторонников Паскуаля Орозко в 1912 году.</p>
  <h3>Хит против Мадеро</h3>
  <p>Несмотря на попытки Мадеро примирить страну, как революционной стороной, Сапатой и Виллой, так и консервативной, они не прекратили вооруженных восстаний.</p>
  <p>Последнее, называемое Десять трагических десятилетий 1913 года, возглавлял Викториано Уэрта, солдат, который поддерживал Мадеро против Диаса. Уэрта устроил переворот, который закончился убийством президента и установил диктатуру во главе с ним.</p>
  <p>Карранса, хотя и сохранял расхождения с Мадеро, явно выступал против повстанцев. После убийства он обвинил церковь и консерваторов в том, что они скрывают факты.</p>
  <h3>План Гуадалупе</h3>
  <p>Для борьбы с правительством Уэрты Карранса разработал план Гуадалупе. Он заявил, что не признает нового президента и призвал уволить его.</p>
  <p>Карранса сформировал Конституционную армию, из которой он объявил себя первым начальником. Военная кампания началась в Соноре и Чихуахуа.</p>
  <p>Согласно Плану, как только победа будет достигнута, будет сформировано временное правительство до проведения выборов. Перед этим руководителем будет сам Карранса.</p>
  <p>Некоторая поддержка, полученная Каррансой для свержения Уэрты, была Альваро Обрегоном и Панчо Вильей на севере и Эмилиано Сапата на юге, хотя у последнего была своя аграрная программа.</p>
  <p>Пока шла война, Соединенные Штаты воспользовались возможностью вторгнуться в часть мексиканской территории. Карранса договорилась с американцами, убедившись, что они не вмешиваются в происходящее.</p>
  <p>Превосходство революционеров было очевидным, и они побеждали войска Уэрты на всех фронтах. В июле 1914 года диктатор понял, что у него нет шансов, и подал в отставку с поста президента.</p>
  <p>Карранса вместе со своими сторонниками вошел в Мехико. Однако среди них не было ни Виллы, ни Сапаты, прелюдии к столкновениям, которые начались почти сразу.</p>
  <h3>Конвенция Агуаскальентес</h3>
  <p>Попытка стабилизировать ситуацию, созданную после падения Уэрты, произошла в соглашении Агуаскальентес. Карранса вызвал большую часть революционеров, хотя в принципе он оставил сапатистов вне поля зрения. Его намерение состояло в том, чтобы узаконить его временное президентство, но события развивались не так, как он думал.</p>
  <p>Встреча состоялась в октябре 1914 года. Несмотря на предыдущие проблемы, в итоге Сапата и Вилья все же присутствовали на съезде. В то же время их позиции завоевывали поддержку, и Карранса остался в меньшинстве. Даже некоторые из его сторонников, а также другие, которые были Орозко, оказались на стороне Сапаты.</p>
  <p>Сапатисты ранее предлагали в рамках плана Аяла созвать аналогичное собрание для избрания временного президента. Позже это будет отвечать за созыв выборов в Конгресс.</p>
  <h3>Вернуться к Carranza</h3>
  <p>По мере того, как встречи продолжались, Каррансе стало ясно, что его намерение стать временно исполняющим обязанности президента не будет реализовано. По словам историков, его целью было занять эту должность, чтобы представить себе все возможности для будущих выборов, а также начать разрабатывать Конституцию.</p>
  <p>В результате съезда Карранса остался без командования революционеров. Совещание при решительной поддержке сапатистов и виллистов назначило исполняющим обязанности президента Гутьерреса Ортиса с задачей созыва краткосрочных выборов.</p>
  <p>Карранса не принял результат. Таким образом, он объявил себя в восстании и в январе 1915 года отправился в Веракрус со своими сторонниками. Оказавшись там, он реорганизовал свою армию, за что рассчитывал на помощь Альваро Обрегона, Гонсалеса Гарсы и других революционных генералов, противостоящих Сапате и Вилле.</p>
  <p>В Веракрусе Карранса создал собственную администрацию и начал выполнять обязанности правителя. Среди принятых мер - Аграрный закон, положение о разводе и провозглашение независимости судебной власти.</p>
  <p>Помимо своей законодательной работы, он также предпринял военные действия, чтобы попытаться победить победителей конвенции и вернуться в столицу.</p>
  <h3>Возвращение в столицу</h3>
  <p>Война была выгодна интересам Каррансы, особенно благодаря победам, одержанным Обрегоном в период с апреля по июнь 1915 года. Вилья был вынужден покинуть Мехико, оставив путь для возвращения Каррансы. Поражение сапатистов было окончательной почести и привело к признанию Соединенных Штатов.</p>
  <p>Первое, что сделал мексиканский политик, - это поднял необходимость в новой Конституции. Намерение состояло в том, чтобы формализовать предложенные им реформы, о чем он уже говорил в 1913 году.</p>
  <h3>Конституция 1917 года</h3>
  <p>14 сентября 1916 года Карранса объявил, что собирается начать процесс разработки и обнародования нового конституционного текста вместо документа 1857 года. Для этого он созвал Конгресс и разработал нормы для избрания представителей, которые будут его формировать.</p>
  <p>После Агуаскальентеса Карранса не хотел, чтобы история повторилась. По этой причине он предусматривал ряд условий для членства в Учредительном конгрессе, который, теоретически, исключил сапатистов и виллистов.</p>
  <p>Проект Каррансы состоял в том, чтобы реформировать Конституцию 1857 года, которая носила либеральный характер. Однако, когда встречи начались, наиболее прогрессивные отклонили предложенный текст.</p>
  <p>Большинство предпочли отказ, так как, по их словам, не уловили революционные идеалы. По мнению экспертов, позиции сапатистов, хотя и отсутствовали, заняли большую часть конгрессменов.</p>
  <p>Таким образом, итоговая конституция сильно отличалась от предложенной Карранзой. У него не было другого выбора, кроме как принять его, и Великая хартия вольностей была введена в действие 5 февраля 1917 года. В его статью были включены такие достижения, как отношения между работодателями и работниками, меры, благоприятствующие фермерам, и реформа образования.</p>
  <h3>Президентство</h3>
  <p>Хотя часть его конституционного проекта была изменена, Карранса действительно достиг своей цели быть назначенным президентом. 1 мая 1917 года он был приведен к присяге с намерением умиротворить страну.</p>
  <p>Запата и Вилья, несмотря на предыдущие поражения, не оставили своего оружия. Два революционера были ослаблены, но они еще некоторое время продолжали бороться.</p>
  <p>Правительство carrancistas провело политику восстановления инфраструктуры, которая была сильно повреждена годами войны. Он также пытался возобновить экономику, также в очень плохой ситуации из-за затянувшегося конфликта.</p>
  <p>Карранса предпринял робкую аграрную реформу, распределив около двухсот тысяч гектаров, очень далеко от предложений плана Айала.</p>
  <p>Однако за несколько месяцев политика правительства стала более консервативной. Рабочие движения были жестоко подавлены, аграрная реформа парализована. Убийство Эмилиано Сапаты сделало популярность Каррансы еще ниже.</p>
  <h3>Революция Агуа Приета</h3>
  <p>Несмотря на эту потерю популярности, Карранса закончил свой срок в 1920 году. Все думали, что преемником будет Альваро Обрегон, но вместо него президент назвал Игнасио Бонилья, гражданское лицо.</p>
  <p>Обрегон отреагировал незамедлительно, поддержанный Плутарко Элиасом Кальесом и Адольфо де ла Уэрта. Они начали в План де Агуа Приета, отказываясь признать нового правителя.</p>
  <h3>Попытка сбежать и смерть</h3>
  <p>Подписавшие План Агуа Приета завоевали поддержку большей части армии, что дало им определенное преимущество. Карранса попытался повторить маневр, который он уже сделал после Конвенции, и установить правительство в Веракрус.</p>
  <p>Бывший президент уехал в пункт назначения вместе с остальными членами своего кабинета и их семьями. Кроме того, он взял средства у федерального правительства. Они были составлены из серебра, золота и бумажных денег. Короче все что было в казне.</p>
  <p>20 мая 1920 г. достиг станции Алжибес. Дороги были взорваны и должны были проникнуть в Сьерра-Норте-де-Пуэбла. С ним было много его последователей и несколько курсантов Военного училища.</p>
  <p>По пути они остановились, чтобы переночевать в маленьком городке Тласкальантонго, Пуэбла. Именно в этом месте, когда он спал, они были удивлены войсками Родольфо Эрреро в ранние часы 21 мая 1920 года.</p>
  <p>Карранса был убит на месте, без возможности защитить себя. Его тело было похоронено в Гражданском Пантеоне Долорес в Мехико. Позже, в 1942 году, его останки были перенесены в памятник революции.</p>
  `);
  document.getElementById("firstChar").innerHTML = firstCharLet;
}

function fifthChar() {
  let firstCharLet = (document.getElementById(
    "firstChar"
  ).value = `<h2>Порфирио Диас</h2>
  <h3>Путь к власти</h3>
    <p>Будущий диктатор Мексики родился в 1830 году в городе Оахака в семье кузнеца. Отец умер, когда Порфирио было три года. В детстве он подрабатывал столяром и сапожником, окончил школу и поступил в семинарию, надеясь стать священником. Этот выбор не был необычным: в тогдашней Мексике выходец из низов мог сделать карьеру только либо в церкви, либо в армии.</p>
    <p>Однако уже довольно скоро юный Порфирио понял, что быть священником – это не его призвание. В 16 лет он записался в армию. Как раз в это время началась американо-мексиканская война, продлившаяся два года. Но принять участие в её боях юноше было не суждено, всё это время он находился в тылу и занимался ремонтом оружия.</p>
    <p>После войны Диас поступил в Институт наук и искусств Оахаки, где одним из его преподавателей был Бенито Хуарес, будущий президент Мексики. Некоторое время Диас преподавал латынь, сменил несколько профессий, пока в 1854 году не получил диплом адвоката.</p>
    <p>Когда спустя три года в Мексике началась очередная война, на этот раз гражданская между либералами и консерваторами, Диас вновь ушёл в армию. Он сражался на стороне либералов, быстро рос в чинах, принял участие в 12 сражениях, за несколько лет дослужился до полковника. Гражданская война закончилась в 1861 году полной победой либералов, однако до мирной жизни было ещё далеко. Потерпевшие поражение консерваторы не смирились и захотели взять реванш при помощи иностранных армий. Воспользовавшись внутренней смутой, в страну вторглись французские, британские и испанские интервенты. Война с ними продлилась ещё шесть лет.</p>
    <h3>Порфирио Диас в 1861 году</h3>
    <p>Уже в 1862 году 32-летний Диас становится бригадным генералом. Он одерживает победы, что способствует его известности и популярности. В 1865 году он попал во французский плен и смог бежать, что только увеличило ему количество сторонников. Наконец, на завершающем этапе войны в 1867 году войска Диаса взяли столицу страны Мехико.</p>
    <p>Политические амбиции появились у Диаса ещё в ходе войны. Открыто они проявились впервые в 1871 году, когда Диас предпринял попытку мятежа против правящего президента Хуареса, своего бывшего учителя. Попытка окончилась провалом, спустя несколько месяцев Хуарес умер, а Диас получил прощение.</p>
    <p>Но останавливаться Диас не собирался. Новое восстание в 1876 году против преемника Хуареса президента Себастьяна Лердо уже увенчалось успехом: Лердо был смещён, а Диас спустя несколько месяцев легализовал свой захват власти, одержав победу на президентских выборах.</p>
    <h3>Порфириат</h3>
    <p>С этого момента в истории Мексики началась эпоха, названная по имени нового президента – Порфириат. Первоначально Диас старался показать себя большим либералом и демократом, чем его предшественники. Так, он сам внёс в конституцию страны поправку, согласно которой один человек не мог занимать пост президента более одного срока. Это только прибавило ему популярности в народе. Герой двух войн, ещё и добровольно ограничивший свою власть – какой ещё кандидат мог быть лучше?</p>
    <p>На момент прихода к власти Диасу было 47 лет. Не исключено, что он сам думал тогда, что только наведёт в стране порядок и уступит власть другим. Первым делом новый президент наладил отношения с США, привлёк в страну многих американских и европейских инвесторов, что способствовало росту экономики, отменил ряд антиклерикальных законов, что принесло ему поддержку католических священников.</p>
    <p>В конце 1880 года Диас, поскольку не мог переизбраться на следующий срок по конституции, уступил пост президента своему соратнику Мануэлю Гонсалесу. За 4 года правления Гонсалеса коррупция в стране достигла небывалых размеров, поэтому в 1884 году Диас вновь вернулся на пост президента, приветствуемый населением. В конституцию вновь внесли нужные поправки, и Диас смог переизбираться на следующие сроки. А в 1904 году он увеличил срок президентских полномочий с 4 до 6 лет.</p>
    <p>Демократические институты формально сохранялись. Люди Диаса постоянно одерживали победы в парламентских выборах, в стране существовала «оппозиция» в лице Николаса Суньиги. Суньига отличался эксцентричным поведением, его мало кто воспринимал всерьёз, поэтому Диас прекрасно понимал, что выиграть выборы шансов у Суньиги никаких. Те же, у кого подобные шансы были, вынужденно бежали из страны.</p>
    <p>В годы правления Диаса в Мексике наблюдался экономический подъём. В стране появлялись новые предприятия, поступали иностранные инвестиции, строились железные дороги, увеличилось производство кофе, сахара, хлопка, которые шли на экспорт. Однако выгоду от всего этого смогли извлечь лишь несколько десятков олигархических семей – друзей и соратников Диаса. </p>
    <p>Обогащались они также за счёт добычи полезных ископаемых – золота, серебра и меди. Значительно увеличилась и добыча нефти.</p>
    <p>Всё это приносило баснословную прибыль олигархам. Подавляющее же большинство населения продолжало беднеть. 96 % сельских жителей не имели земли и становились батраками. Страна была переполнена нищими, скверно обстояли дела в сферах образования и медицины, которые Диас не считал нужным развивать. В 1910 году лишь 19 % мексиканцев были грамотными. Детская смертность составляла 400 детей на 1000. 50 % всего жилого фонда составляли лачуги – жилища из одной комнаты без воды, электричества и канализации. Поскольку медицина была в запущенном состоянии, то частыми в стране были эпидемии оспы, тифа, малярии, дизентерии и других болезней.</p>
    <h3>Рынок в Мехико. 1885 год</h3>
    <p>На этом и без того печальном фоне особенно незавидной была жизнь рабочих: они работали по 12 часов в сутки и по 7 дней в неделю. Зарплату довольно часто им выдавали не деньгами, а марками, которые принимались только в фабричных лавках или магазинах помещиков. Примерно четверть рабочих составляли женщины, которым платили вдвое меньше, чем мужчинам. Как среди рабочих, так и в крестьянской среде был широко распространён алкоголизм.</p>
    <p>Армия и полиция были целиком под контролем Диаса, в несколько раз увеличилась численность конной жандармерии (руралес), которая успешно подавляла разрозненные и неорганизованные крестьянские восстания. Среди жандармов появилось также много уголовников.</p>
    <h3>Мексиканские бедняки. 1906 год</h3>
    <p>Диас позволял обогащаться своим друзьям, но и себя при этом не забывал. Он приобрёл множество поместий, коллекционировал оружие и картины, любил показную роскошь: сохранившиеся фотографии из его салон-вагона напоминали жилище цыганского барона. Как гласит известный афоризм, абсолютная власть развращает абсолютно.</p>
    <h3>Порфирио Диас в 1907 году</h3>
    <p>В 1908 году, когда Диасу было уже 78 лет, он объявил, что семи президентских сроков достаточно и на следующий он баллотироваться не будет. Однако его ближайшие сторонники тут же начали борьбу за власть, давно ожидавшие, когда «старик», как они его называли, уйдёт. В этой обстановке в 1910 году Диас нарушил собственное слово и переизбрался на следующий срок. Хотя выборы в Мексике давно уже превратились в фарс, в этот раз махинации на них были такие, что это вызвало массовые возмущения по всей стране. Недовольных возглавил оппозиционный кандидат Франсиско Мадеро, которого, кстати, изначально тоже никто не воспринимал всерьёз.</p>
    <h3>Парад в Мехико. 1910 год</h3>
    <p>В стране началась революция и гражданская война, всё большую роль стали играть различные бандиты и партизанские вожаки с ореолом «народных заступников» вроде Панчо Вильи. В этой обстановке 81-летний Диас больше не в силах был продолжать правление. В мае 1911 года он отрёкся от власти и тут же бежал сначала в Испанию, а потом в Париж. Там он и скончался спустя четыре года, окружённый награбленным богатством, но проклинаемый на родине миллионами соотечественников.</p>
    <p>Спустя всего пару недель после его бегства в Мехико вступила повстанческая армия, приветствуемая радостными криками сотен тысяч горожан.</p>
    <p>Мексиканская революция и гражданская война, начавшаяся в 1910 году из-за массового недовольства населения правлением Диаса, продлилась 10 лет. В её ходе погибло до 2 млн человек военных и гражданских, что было огромной цифрой для сравнительно небольшой Мексики, всё население которой в то время едва достигало 15 млн. От Порфириата революция не оставила камня на камне.</p>
    <p>В современной Мексике имя Порфирио Диаса предано забвению, в честь него не названо ни одной улицы, а его останки по-прежнему покоятся на одном из кладбищ Парижа. Кто знает, возможно, уйди он в отставку после первого срока, и сегодня по всей Мексике стояли бы памятники ему, а погибшие в ходе гражданской войны 2 млн человек дожили бы до старости.</p>`);
  document.getElementById("firstChar").innerHTML = firstCharLet;
}

function sixthChar() {
  let firstCharLet = (document.getElementById("firstChar").value = `
  <h2>Франциско Игнасио Мадеро</h2>
  <h3></h3>
  <p>Появился на свет 30 октября 1873 года в гасиенде «Эль Росарио» в Паррас-де-ла-Фуэнте (Коауила). Он принадлежал к богатой семье, которая владела несколькими гасиендами, шахтами и другими предприятиями.</p>
  <h3>Учеба и первая работа</h3>
  <p>Как обычно во многих семьях с хорошим положением, Франциско начал свое обучение с частными репетиторами. Позже он продолжил обучение в Сальтильо, в центре Сан-Хуан-де-Непомучено, в школе иезуитов.</p>
  <p>Завершая этот этап, отправился в Соединенные Штаты, чтобы реализовать исследования сельского хозяйства. Позже он переехал во Францию, где окончил коммерческий факультет Высшей школы бизнеса в Жуй-ан-Жозасе.</p>
  <p>Наконец, он вернулся в Соединенные Штаты, чтобы завершить свое обучение в области сельского хозяйства в университете Беркли, Калифорния.</p>
  <p>В 1892 году он вернулся в Мексику, чтобы завладеть имением, принадлежавшим его семье в Сан-Педро-де-лас-Колония. Его биографы отмечают, что в те годы он давал образцы своих прогрессивных идей и пытался улучшить условия труда работников.</p>
  <p>Что касается его личной жизни, он начал свои ухаживания с Сарой Перес Ромеро в 1897 году, женившись на ней в 1903 году.</p>
  <h3>Порфириато</h3>
  <p>Политическая жизнь в Мексике в то время была отмечена Порфириато, имя, данное диктатуре Порфирио Диаса. Это пришло к власти в 1876 году под девизом поддержания порядка в стране и ускорения ее экономического роста.</p>
  <p>Для этого он использовал поддержку самых привилегированных слоев общества: церкви, армии и владельцев асьенд.</p>
  <p>Порфирио удалось стабилизировать нацию, а также улучшить экономику с точки зрения больших чисел. Тем не менее, первое, что было сделано за счет прекращения демократии и подавления любого намека на оппозицию.</p>
  <p>Второе, с другой стороны, достигло только высших слоев общества, в то время как неравенство возрастало, и большая часть населения жила в нищете.</p>
  <p>Уже в последние годы его президентства, когда Мадеро достиг зрелости, режим начал ослабевать. Жалобы поступали не только из обездоленных секторов, но и часть элиты начала бунтовать.</p>
  <h3>Вступление в политику</h3>
  <p>Мадеро долго занимался политикой. Ранее он основал коммерческую школу Сан-Педро, которая оказала ему некоторое влияние в некоторых кругах.</p>
  <p>Это было в 1905 году, как реакция на злоупотребления властью губернатора Коауила, когда он сделал шаг и основал свою собственную партию: Независимую демократическую партию. В то же время он начал распространять свои идеи в газете El Democratico. Основной целью его политического формирования было положить конец переизбранию.</p>
  <p>С этой даты также его участие в газете даты регенерации. Он также связался с Организационным советом Либеральной партии Мексики. Его несогласие с Флоресом Магоном заставило его отказаться от поддержки этого движения.</p>
  <h3>Публикация президентской преемственности 1910 года</h3>
  <p>Политический ландшафт в стране, казалось, менялся. Сам Порфирио Диас, похоже, был готов демократизировать Мексику, когда в 1908 году он заявил в интервью, что другие конкуренты могут участвовать в следующих выборах.</p>
  <p>После этого интервью Мадеро воспользовался возможностью опубликовать книгу под названием «Президентское правопреемство 1910 года». В этой работе он объяснил свои идеи по улучшению страны и ее демократизации. Хотя он имел умеренный охват, если он достиг многих влиятельных слоев общества.</p>
  <p>Хороший прием его книги вдохновил его на создание в 1909 году Национальной антиреволюционной партии. Мадеро был провозглашен кандидатом и начал готовиться к выборам 1910 года.</p>
  <p>Однако Диас передумал. Мало того, что он собирался появиться снова, но он начал кампанию преследования заявителя, чтобы сменить его.</p>
  <h3>Арест Мадеро</h3>
  <p>Растущая популярность Мадеро заставила Диаса заказать его арест. Так, по обвинению в мятеже и возмущении политик был арестован 7 июня и переведен в Сан-Луис-Потоси.</p>
  <p>Не имея возможности присутствовать, Мадеро размышлял о том, как Диас был снова провозглашен президентом. Согласно некоторым источникам, революционное будущее пыталось договориться с диктатором о мирном решении ситуации, но Диас не согласился с каким-либо возможным диалогом.</p>
  <p>В октябре 1910 года Мадеро удается сбежать из тюрьмы и уехать в Соединенные Штаты.</p>
  <h3>План Сан-Луиса</h3>
  <p>Документ, известный как План-де-Сан-Луис, фактически датирован в этом месте. В частности, 5 октября 1910 года, последний день, который Мадеро провел в тюрьме. Однако многие историки считают, что это на самом деле было написано во время его ссылки в США.</p>
  <p>Таким образом, в этом обращении Мадеро осудил злоупотребления, совершенные диктатурой, призывая свергнуть Порфирио Диаса. Кроме того, он сломал некоторые из своих проектов, таких как намерение помочь крестьянам путем проведения аграрной реформы.</p>
  <p>Мадеро установил дату начала восстания против Диаса: 20 ноября 1910 года, начало мексиканской революции.</p>
  <h3>Свержение Порфирио Диаса</h3>
  <p>Призыв Мадеро к оружию нашел поддержку в значительной части мексиканского общества. В нескольких штатах страны начались восстания в день, указанный в Плане.</p>
  <p>Среди тех, кто поддержал восстание, были некоторые из лидеров, которые станут частью истории Мексики. Среди них Паскуаль Орозко, Эмилиано Сапата и Панчо Вилья.</p>
  <p>Сначала восстание потерпело несколько поражений. Однако Порфириато был очень ослаблен, а армия оказалась очень неподготовленной. Через несколько месяцев Революция распространилась по всем уголкам страны.</p>
  <p>Всего через шесть месяцев после начала восстания, в мае, повстанцы взяли Сьюдад-Хуарес. 25 числа того же месяца им удалось осадить Мехико. Перед неминуемым поражением Порфирио Диас подал в отставку и ушел в изгнание.</p>
  <h3>Президентство Мадеро</h3>
  <p>Революционеры сформировали временное правительство после ухода Порфирио Диаса. Вскоре между ними начинают появляться противоречия, и выборы в октябре 1911 года не смогли успокоить ситуацию. На этих выборах Мадеро был избран президентом республики.</p>
  <p>В программе своего образования вновь созданная Прогрессивная конституционная партия обратила внимание на социальные проблемы, но она была более умеренной, чем подходы, например, Эмилиано Сапата.</p>
  <p>В те месяцы, когда он был у власти, Франциско И. Мадеро пытался примирить страну. Однако с самого начала он оказался между своими бывшими революционными союзниками и консерваторами, включая могущественную католическую церковь.</p>
  <p>Одной из утвержденных мер был закон о перераспределении земли, хотя он казался недостаточным для крестьян и сапатов. С другой стороны, шахтеры начали серию забастовок, чтобы попросить улучшения в труде. Мадеро сократил рабочий день с 12 до 10 часов ежедневно.</p>
  <h3>Оппозиция</h3>
  <p>Консервативный блок был объединен против правительства, чего все ожидали. Что, по мнению историков, больше всего повредило Мадеро, так это великое разобщение между либералами и прогрессивами.</p>
  <p>Аграрии-сапаты взялись за оружие, провозгласив его в План-де-Айала 25 ноября 1911 года. В дополнение к критике президента, назвав его предателем, он предложил Орозко в качестве замены. В документе Сапата обрисовал в общих чертах подходы амбициозной аграрной реформы, которая будет иметь большое влияние в последующие десятилетия.</p>
  <p>В течение года сапатисты и мадеристы конфликтовали в военном отношении, и ни одна из сторон не вышла победителем. Однако это вызвало ослабление власти.</p>
  <p>Между тем консерваторы также устроили несколько восстаний. Первый - генерал Бернардо Рейес, бывший министр Порфирио Диаса.</p>
  <h3>Начало трагической десятки</h3>
  <p>Эти восстания привели к тому, что военный, которому сначала доверял Мадеро, приобрел большой авторитет за свои выступления: Викториано Уэрта.
  Тем не менее, Уэрта амбициозный гораздо больше и, в конце концов, предал Мадеро. Он был главным героем Десять Трагических, десять жестоких дней переворота, который начался 9 февраля 1913 года.
  </p>
  <p>Уэрта, несмотря на то, что боролся за правительство, поддерживал очень хорошие отношения с Бернардо Рейесом и Феликсом Диасом, племянником Порфирио. Встречи между ними и американским послом Генри Уилсоном были непрерывными. Целью было свергнуть конституционное правительство Мадеро.</p>
  <p>Лидер восстания, военный начальник, оставил Мехико без охраны, чтобы Мадеро не мог защитить себя, и его удаление было легче.</p>
  <h3>Измена Уэрты</h3>
  <p>Когда началось восстание, Мадеро был в Кастильо-де-Чапультепек. Когда он узнал, он собрал несколько лояльных войск, с которыми он столкнулся, и отправился в Национальный дворец, который называется «Марш лояльности».</p>
  <p>Президент уже 12-го числа встретился с несколькими иностранными послами, в том числе американскими. Он, который поддержал переворот, через третьих лиц сообщил ему, что единственным выходом из спасти его жизнь была его отставка.</p>
  <p>То же самое говорили некоторые сенаторы, вызванные Педро Ласкураном. Мадеро, несмотря на предупреждения, заявил, что «только мертвым или по поручению народа я покину Национальный дворец».</p>
  <p>Только 17-го числа сторонники президента обнаружили, что Уэрта был лидером восстания. Брат Мадеро решил арестовать военного, который отрицал свое участие в событиях. Президент поверил и освободил его, дав ему 24 часа, чтобы показать свою лояльность.</p>
  <p>На следующий день Уэрта и Феликс Диас подписали Пакт Сьюдаделы. При этом они не знали Мадеро и дали ему 72 часа для увольнения. После этого они сообщили некоторым губернаторам, что Мадуро был в плену и что Уэртас был новым президентом.</p>
  <h3>Задержание Мадеро</h3>
  <p>Арест Мадеро произошел в том же 18 февраля. Уэрта и другие генералы заверили его, что они все еще лояльны, и посоветовали ему переехать в более безопасное место. Гонсалес Гарза, этот верный президенту, понял намерения заговорщиков и крикнул: «Приходите, чтобы задержать президента Мадеро!».</p>
  <p>Во дворце была лишь небольшая группа солдат, верных Мадеро, и они не могли противостоять батальону, отправленному заговорщиками, чтобы арестовать его. У Мадеро не было другого выбора, кроме как сдаться. Вместе с вице-президентом Пино Суаресом, его братьями и другими сторонниками он провел ночь в заключении в том же Национальном дворце.</p>
  <p>Когда эта новость распространилась, несколько иностранных послов обратились с просьбой о уважении жизни Мадеро и его последователей, которые предложили политическое убежище на Кубе. Ласкуран, который согласно Конституции должен был заменить Мадеро, попросил президента подать в отставку, чтобы спасти свою жизнь.</p>
  <p>После нескольких часов напряженности Франсиско Мадеро подписал заявление об уходе с должности. Ласкуран занял его место, но только на 45 минут. Его единственной мерой было назначить Уэрту секретарем правительства и подать в отставку, чтобы он занял пост президента. Одним из первых решений Уэрты как агента было отдать приказ о смерти Мадеро.</p>
  <h3>Смерть</h3>
  <p>Согласно хроникам, Мадеро и Пино Суарес верили в обещания Уэрты оставить их в живых и позволить им отправиться в изгнание. Чего они не знали, так это того, что к тому времени брат Мадеро уже был убит.</p>
  <p>22 февраля двум политикам сообщили, что тюрьма будет переведена. Слова Мадеро, прощающиеся с Гарзой «прощай, мой генерал, я никогда не вернусь к завесе», по-видимому, указывают на то, что, наконец, он понял, что Уэртас не собирается их отпускать.</p>
  <p>Оба были доставлены во Дворец Лекамберри и отвезены на заднее сиденье. Там майор Франсиско Карденас уволил Франциско И. Мадеро, в результате чего он погиб. Затем был также казнен Пино Суарес.</p>
  <p>Новые власти заявили, что Мадеро и Пино попали в засаду во время перевода. Потребовалось еще несколько лет, чтобы правда раскрылась.</p>
  <p>Убийцы похоронили тела в задней части пенитенциарного учреждения и на следующий день распространили официальную версию.</p>
  <h3>Реакции на смерть</h3>
  <p>Смерть Франциско Мадеро вызвала реакцию во всем мире. «Нью-Йорк таймс», 23 февраля, уже опубликовала тот факт, что он был убит двумя выстрелами в голову. Наконец, правительство США отказалось признать правительство Уэрты за то, что оно пришло к власти с помощью насилия.</p>
  <p>На остальной части континента были также реакции против казни, и во внутренних районах Мексики начались небольшие восстания. Карранса, противник Мадеро, но политически ближе, чем Уэрта, обвинил новое правительство в смерти.</p>
  
  
  `);
  document.getElementById("firstChar").innerHTML = firstCharLet;
}

document.addEventListener("DOMContentLoaded", function () {
  const button1 = document.getElementById("fBut");
  const button2 = document.getElementById("sBut");
  const button3 = document.getElementById("tBut");
  const button4 = document.getElementById("foBut");
  const button5 = document.getElementById("fiBut");
  const button6 = document.getElementById("siBut");
  const card = document.querySelector(".charText");

  button1.addEventListener("click", function () {
    card.scrollIntoView({ behavior: "smooth" });
  });
  button2.addEventListener("click", function () {
    card.scrollIntoView({ behavior: "smooth" });
  });
  button3.addEventListener("click", function () {
    card.scrollIntoView({ behavior: "smooth" });
  });
  button4.addEventListener("click", function () {
    card.scrollIntoView({ behavior: "smooth" });
  });
  button5.addEventListener("click", function () {
    card.scrollIntoView({ behavior: "smooth" });
  });
  button6.addEventListener("click", function () {
    card.scrollIntoView({ behavior: "smooth" });
  });
});
